using DifferentialEquations, Parameters

T = 5000.0

function sipv!(du, u, p, t)
    @unpack α, β, γ, ϵ, θ₁, θ₂, κ, ρ₁, ρ₂, ϕ, ψ, ω = p
    S1, I1, v1, S2, I2, v2 = u
    du[1] = α*(ψ-S1-I1) - β*S1*(I1+ϕ*I2) - ϵ*v1*S1
    du[2] = β*S1*(I1+ϕ*I2) - γ*I1
    du[3] = 1/(1+exp(-κ*(β*(I1+ϕ*I2) - ρ₁ - θ₁*(1-2*(v1+ω*v2)/(1+ω))))) - v1
    du[4] = α*(1-ψ-S2-I2) - β*S2*(ϕ*I1+I2) - ϵ*v2*S2
    du[5] = β*S2*(ϕ*I1+I2) - γ*I2
    du[6] = 1/(1+exp(-κ*(β*(ϕ*I1+I2) - ρ₂ - θ₂*(1-2*(ω*v1+v2)/(1+ω))))) - v2
end

u0 = [0.4; 0.1; 0.01; 0.5; 0.0; 0.01]
p = (α=1/100, β=0.5, γ=1/7, ϵ=1/7, θ₁=0.01, θ₂=0.01, κ=1000, ρ₁=0.01, ρ₂=0.01, ϕ=0.01, ψ=0.5, ω=0.01)
tspan = (0.0,T)